create_clock -period 10.000 -name ACLK -waveform {0.000 5.000} [get_ports ACLK]
set_input_delay -clock [get_clocks ACLK] -min 1.200 [get_ports {S_AXIS_TDATA[*]}]
set_input_delay -clock [get_clocks ACLK] -max 4.000 [get_ports {S_AXIS_TDATA[*]}]
set_input_delay -clock [get_clocks ACLK] -min 1.200 [get_ports ARESETN]
set_input_delay -clock [get_clocks ACLK] -max 4.000 [get_ports ARESETN]
set_input_delay -clock [get_clocks ACLK] -min 1.200 [get_ports M_AXIS_TREADY]
set_input_delay -clock [get_clocks ACLK] -max 4.000 [get_ports M_AXIS_TREADY]
set_input_delay -clock [get_clocks ACLK] -min 1.200 [get_ports S_AXIS_TVALID]
set_input_delay -clock [get_clocks ACLK] -max 4.000 [get_ports S_AXIS_TVALID]
set_output_delay -clock [get_clocks ACLK] -min 0.700 [get_ports {M_AXIS_TDATA[*]}]
set_output_delay -clock [get_clocks ACLK] -max 1.500 [get_ports {M_AXIS_TDATA[*]}]
set_output_delay -clock [get_clocks ACLK] -min 0.700 [get_ports M_AXIS_TLAST]
set_output_delay -clock [get_clocks ACLK] -max 1.500 [get_ports M_AXIS_TLAST]
set_output_delay -clock [get_clocks ACLK] -min 0.700 [get_ports M_AXIS_TVALID]
set_output_delay -clock [get_clocks ACLK] -max 1.500 [get_ports M_AXIS_TVALID]
set_output_delay -clock [get_clocks ACLK] -min 0.700 [get_ports S_AXIS_TREADY]
set_output_delay -clock [get_clocks ACLK] -max 1.500 [get_ports S_AXIS_TREADY]
